
#### Terraform Plan 📖
```
Acquiring state lock. This may take a few moments...
module.common.google_storage_bucket.sykmelding-xml: Refreshing state... [id=tsm-sykmelding-xml-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common.google_storage_bucket.sykmelding-xml must be replaced
-/+ resource "google_storage_bucket" "sykmelding-xml" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "tsm-sykmelding-xml-prod" -> (known after apply)
      ~ name                        = "tsm-sykmelding-xml-prod" -> "tsm-sykmelding-prod" # forces replacement
      ~ project                     = "tsm-prod-1dab" -> (known after apply)
      ~ project_number              = 906118489000 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/tsm-sykmelding-xml-prod" -> (known after apply)
      ~ url                         = "gs://tsm-sykmelding-xml-prod" -> (known after apply)
        # (7 unchanged attributes hidden)

      - hierarchical_namespace {
          - enabled = false -> null
        }

      ~ soft_delete_policy (known after apply)
      - soft_delete_policy {
          - effective_time             = "2025-03-12T10:58:47.293Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      ~ versioning (known after apply)

      ~ website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
